#字典
arr={'时':100,'点':200}
print(type(arr))                              #<class 'dict'>
print(arr)                                    #{'时': 100, '点': 200}
arr1={1:100,2:200}
print(arr1)                                   #{1: 100, 2: 200}
arr2=dict(name='jack',age=20,time='20')
print(arr2)                                   #{'name': 'jack', 'age': 20, 'time': '20'}
#字典名={ 键1:值1 , 键2:值2,·····}       它的储存顺序和输入顺序无关,键名不能重复，否则被最后输入的覆盖。值可以重复。键是字符串时有单引号
#字典名= dict( name=内容 ,age=内容 )          等号左面不能是数字，且没有单引号
 

#字典查询
arr={'时':100,'点':200}
print(arr['点'])                #200
print(arr.get('时'))            #100
print(arr.get('爱',99))         #99
#字典名['键名']
#字典名 .get('键名')
#字典名 .get('键名',值)        找不到会有一个返回值